benchmark_results_lxc/fileio_bench_rndwr_18G_lxc.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 144MiB each
18GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     673.07
    fsyncs/s:                     862.35

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               10.52

General statistics:
    total time:                          120.0418s
    total number of events:              184195

Latency (ms):
         min:                                    0.00
         avg:                                    0.65
         max:                                   22.25
         95th percentile:                        2.48
         sum:                               119758.80

Threads fairness:
    events (avg/stddev):           184195.0000/0.00
    execution time (avg/stddev):   119.7588/0.00