benchmark_results_lxc/fileio_bench_seqwr_lxc.txt
sysbench 1.0.18 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 56MiB each
7GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential write (creation) test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     6952.02
    fsyncs/s:                     8898.82

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               108.63

General statistics:
    total time:                          300.0086s
    total number of events:              4755338

Latency (ms):
         min:                                    0.00
         avg:                                    0.06
         max:                                   75.53
         95th percentile:                        0.04
         sum:                               296452.58

Threads fairness:
    events (avg/stddev):           4755338.0000/0.00
    execution time (avg/stddev):   296.4526/0.00